<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5a85b58be91cefcf3c57eb755297acaa3093b4d61c3cf0b4cdd600336dbb5c05","plan_job_ref":"Job Run Terraform plan in staging #209 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13899083820","plan_out_hash":"28b2dec5191afcc236b45e43a6a2e8852b55c5fd52a3a3c3875dc4ffb8060d98","plan_hash":"75467d1d35595a914a14863765bd75aac7c079af8a16e57a27ac8fe3b7118a54","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "0YFo37VHLzXs7uy654+72fTOS/uywPtbE+BmURMLim4=" -> "Hu9U2NzZCXNgOhorHVeWfHaRqn2neMcuw2Ld6vRiV8o="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-03-12T12:37:00Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #209](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13899083820)